content-org/articles.org
#+hugo_base_dir: ../
#+hugo_section: articles
#+author: rudra kar
#+OPTIONS: toc:2


* Articles
:PROPERTIES:
:CUSTOM_ID: articles
:END:

** Recreational programming as a hobby
:PROPERTIES:
:CUSTOM_ID: recreational-programming-as-a-hobby
:EXPORT_FILE_NAME: recreational-programming-as-a-hobby
:EXPORT_DATE: 2024-10-11
:END:



*** Abstract
:PROPERTIES:
:CUSTOM_ID: abstract
:END:

For a long period of time, there existed a small group of people who
wouldn't program for a living, rather program to either solve problems
or just have fun. I was lucky enough to have a job that lets me write
programs for money, and over the time it grayed the line between
programming for fun vs programming for money.

