content/articles/recreational-programming-as-a-hobby.md
+++
title = "Recreational programming as a hobby"
author = ["rudra kar"]
date = 2024-10-11
draft = false
+++

<div class="ox-hugo-toc toc">

<div class="heading">Table of Contents</div>

- [Abstract](#abstract)

</div>
<!--endtoc-->


## Abstract {#abstract}

For a long period of time, there existed a small group of people who
wouldn't program for a living, rather program to either solve problems
or just have fun. I was lucky enough to have a job that lets me write
programs for money, and over the time it grayed the line between
programming for fun vs programming for money.
